artilleryPost.yml
config:
  target: 'http://localhost:8081'
  processer: "./artilleryFunctions.js"
  phases:
    - duration: 60
      arrivalRate: 1000
scenarios:
  - flow:
    - function: "generateRandomData"
    - post:
        url: "/api/houses"
        json:
          street: {{ street }}
          city: {{ city }}
          state: {{ state }}
          zip: {{ zip }}
          listing_agent: {{ listing_agent }}