artilleryPost.yml
config:
  target: 'http://localhost:8081'
  phases:
    - duration: 60
      arrivalRate: 1000
scenarios:
  - flow:
    - post:
        url: "/api/houses"
        json:
          street: "619 Ward Rapids"
          city: "Keelingberg"
          state: "OK"
          zip: 12271
          listing_agent: 14